#include <stdlib.h>
#include <stdio.h>


int main() {
    printf("배가 고파서 집에서 나오는 길 늘 그렇듯 늘어선 가로등은 타오르지 마치 싸울듯이 엉켜있는 자동차들은 다 하나같이 서로 비킬 맘은 없지 비가 좀 온 탓 인지는 몰라도 내생각 보다 덥지 않아 놀랐어");
    printf("모처럼 목욕한 거리위를 걷다 보니깐 가려던 거리보다 훨씬 더 갔어 아슬아슬한 신호등을 건너 얼룩말같은 횡단보도를 건너 저녁노을이 앉아있는 언덕을 넘어가다 보면 그녀의 기억들이 모여 ");
    printf("널 바래다주느라 자주 왔던 길 널 기다리느라 시간이 남던 길 모든게 그대로 인데 어느새 우리 둘만 싹 바꼈지 마치 남인 듯이 너의 집에 가까워졌어 너의 이름을 크게 불러봐도 너는 너무 멀어");
    printf(" 아무의미 없어진 나의 산책 너가 묻은 길을 돌아보고 다시 길을 걸어 지금 내 기분은 밤보다 어둡고 혼자 떠 있는 달보다 더 서글퍼 이별이란게 이리 어려운거 였으면 너가 뭘 원하든 간에 더 줄걸");
    printf(" 다시 되돌리고파 너를 유턴처럼 허나 우리 사인 복잡해 뉴턴처럼 내게 이 모든 상황을 동전처럼 엎어버리는 것 보다 더 좋은 건 없어 배가 고파서 집에서 나왔던 길 그건 다 핑계였던걸 애초에 알았었지 ");
    printf("하루종일 안 먹고 버텼던 밥보다 너가 내 머리 속에서 자꾸만 안떠나 하나도 변한것 없는 거의 집 근처 내 마음은 이미 너네 집 입구에 있어 문을 두드리고 싶은 걸 꾹 참아 난 그정도론 안 짖궂어");
    printf("너의 집에 가까워 졌어 너의 이름을 크게 불러봐도 너는 너무 멀어 아무의미 없어진 나의 산책 너가 묻은 길을 돌아보고 다시 길을 걸어 자연스럽게 너의 집을 지나 애초에 걷지 말아야했었던 길을 지나");
    printf("다시 집으로 돌아 오는 길 마치 뭔가 두고 온 듯해 노래 서너 곡쯤을 듣다가 보면 다 잊겠지 돌아오는 길에 금방 너의 집은 이리 가까운데 넌 너무 먼 듯해 ");
    printf("너의 집에 가까워졌어 너의 이름을 크게 불러봐도 너는 너무 멀어 아무의미 없어진 나의 산책 너가 묻은 길을 돌아보고 다시 길을 걸어 너의 집에 가까워졌어 너의 이름을 크게 불러봐도 너는 너무 멀어");
    printf(" 아무의미 없어진 나의 산책 너가 묻은 길을 돌아보고 다시 길을 걸어 걸어");
}